STMicroelectronics/STM32CubeL5/Projects/STM32L552E-EV/Demonstrations/Modules/ucpd/usbpd_dpm_user.c
/* Private function prototypes -----------------------------------------------*/
/** @defgroup USBPD_USER_PRIVATE_FUNCTIONS USBPD USER Private Functions
  * @{
  */
/* USER CODE BEGIN USBPD_USER_PRIVATE_FUNCTIONS_Prototypes */
#if !defined(USBPDCORE_LIB_NO_PD)
#if defined(_SNK) || defined(_DRP)
static  void DPM_SNK_BuildRDOfromSelectedPDO(uint8_t PortNum, uint8_t IndexSrcPDO, USBPD_DPM_SNKPowerRequestDetails_TypeDef* PtrRequestPowerDetails,
                                             USBPD_SNKRDO_TypeDef* Rdo, USBPD_CORE_PDO_Type_TypeDef *PtrPowerObject);
static uint32_t DPM_FindVoltageIndex(uint32_t PortNum, USBPD_DPM_SNKPowerRequestDetails_TypeDef* PtrRequestPowerDetails);
#endif /*_SNK || _DRP */
#endif /* !USBPDCORE_LIB_NO_PD */
#if defined(_SRC) || defined(_DRP)
static USBPD_StatusTypeDef DPM_TurnOnPower(uint8_t PortNum, USBPD_PortPowerRole_TypeDef Role);
static USBPD_StatusTypeDef DPM_TurnOffPower(uint8_t PortNum, USBPD_PortPowerRole_TypeDef Role);
#endif /* _SRC || _DRP */
#if defined(_DRP)
static void                DPM_AssertRp(uint8_t PortNum);
static void DPM_AssertRd(uint8_t PortNum);
#endif /* _DRP */
#if defined(_RTOS)
static uint32_t CheckDPMTimers(void);
#endif /* _RTOS */

#if defined(USBPD_REV30_SUPPORT)
#if _SRC_CAPA_EXT
static void DPM_ManageExtendedCapa(void);
#endif /* _SRC_CAPA_EXT */
#if _ALERT
static void DPM_ManageAlert(void);
#endif /* _ALERT */
#endif /* USBPD_REV30_SUPPORT */

/* USER CODE END USBPD_USER_PRIVATE_FUNCTIONS_Prototypes */

/**
  * @}
  */

/* Exported functions ------- ------------------------------------------------*/
/** @defgroup USBPD_USER_EXPORTED_FUNCTIONS USBPD USER Exported Functions
  * @{
  */
/* USER CODE BEGIN USBPD_USER_EXPORTED_FUNCTIONS */

/* USER CODE END USBPD_USER_EXPORTED_FUNCTIONS */

/** @defgroup USBPD_USER_EXPORTED_FUNCTIONS_GROUP1 USBPD USER Exported Functions called by DPM CORE
  * @{
  */
/* USER CODE BEGIN USBPD_USER_EXPORTED_FUNCTIONS_GROUP1 */

/* USER CODE END USBPD_USER_EXPORTED_FUNCTIONS_GROUP1 */

/**
  * @brief  Initialize DPM (port power role, PWR_IF, CAD and PE Init procedures)
  * @retval USBPD Status
  */
#if defined(USBPDCORE_LIB_NO_PD)
USBPD_StatusTypeDef USBPD_DPM_UserInit(void)
{
  return USBPD_OK;
}
#else
USBPD_StatusTypeDef USBPD_DPM_UserInit(void)
{
/* USER CODE BEGIN USBPD_DPM_UserInit */
  /* Demo initialisation */
  DEMO_InitBSP();

  /* PWR SET UP */
  if(USBPD_OK !=  USBPD_PWR_IF_Init())
  {
    return USBPD_ERROR;
  }

 /* VDM initialisation */
#ifdef _VDM
  if(USBPD_TRUE == DPM_Settings[USBPD_PORT_0].PE_VDMSupport)
  {
    if (USBPD_OK != USBPD_VDM_UserInit(USBPD_PORT_0))
    {
      return USBPD_ERROR;
    }
  }
#if USBPD_PORT_COUNT == 2
  if(USBPD_TRUE == DPM_Settings[USBPD_PORT_1].PE_VDMSupport)
  {
    if (USBPD_OK != USBPD_VDM_UserInit(USBPD_PORT_1))
    {
      return USBPD_ERROR;
    }
  }
#endif /* USBPD_PORT_COUNT == 2 */
#elif defined(_VCONN_SUPPORT)
  if (USBPD_OK != USBPD_VDM_UserInit(USBPD_PORT_0))
  {
    return USBPD_ERROR;
  }
#if USBPD_PORT_COUNT == 2
  if (USBPD_OK != USBPD_VDM_UserInit(USBPD_PORT_1))
  {
    return USBPD_ERROR;
  }
#endif /* USBPD_PORT_COUNT == 2 */
#endif /* _VDM */

  DEMO_InitTask();

#ifdef _RTOS
#if (osCMSIS < 0x20000U)
  osMessageQDef(MsgBox, DPM_BOX_MESSAGES_MAX, uint32_t);
  DPMMsgBox = osMessageCreate(osMessageQ(MsgBox), NULL);
  if(NULL == osThreadCreate(osThread(DPM), &DPMMsgBox))
#else
  DPMMsgBox = osMessageQueueNew (DPM_BOX_MESSAGES_MAX, sizeof(uint32_t), NULL);
  if (NULL == osThreadNew(USBPD_DPM_UserExecute, &DPMMsgBox, &DPM_Thread_Atrr))
#endif /* osCMSIS < 0x20000U */
  {
    return USBPD_ERROR;
  }
#else
#endif /* _RTOS */

  return USBPD_OK;
/* USER CODE END USBPD_DPM_UserInit */
}
#endif /* USBPDCORE_LIB_NO_PD */

/**
  * @brief  Function to set the function ptr linked to GUI interface
  * @param  PtrFormatSend Pointer on function to format and send GUI notifications
  * @param  PtrPost       Pointer on function to send GUI notifications
  * @param  PtrSaveInfo   Pointer on function to save information from Port Partner
  * @retval None
  */
void USBPD_DPM_SetNotification_GUI(GUI_NOTIFICATION_FORMAT_SEND PtrFormatSend, GUI_NOTIFICATION_POST PtrPost, GUI_SAVE_INFO PtrSaveInfo)
{
  DPM_GUI_PostNotificationMessage   = PtrPost;
  DPM_GUI_FormatAndSendNotification = PtrFormatSend;
  DPM_GUI_SaveInfo                  = PtrSaveInfo;
}

/**
  * @brief  User delay implementation which is OS dependent
  * @param  Time time in ms
  * @retval None
  */
void USBPD_DPM_WaitForTime(uint32_t Time)
{
/* USER CODE BEGIN USBPD_DPM_WaitForTime */
#ifdef _RTOS
  osDelay(Time);
#else
  HAL_Delay(Time);
#endif
/* USER CODE END USBPD_DPM_WaitForTime */
}

/**
  * @brief  User processing time, it is recommended to avoid blocking task for long time
  * @param  argument  DPM User event
  * @retval None
  */
#ifndef _RTOS
void USBPD_DPM_UserExecute(void const *argument)
#else
#if (osCMSIS < 0x20000U)
void USBPD_DPM_UserExecute(void const *argument)
#else
void USBPD_DPM_UserExecute(void *argument)
#endif /* osCMSIS < 0x20000U */
#endif /* !_RTOS */
{
/* USER CODE BEGIN USBPD_DPM_UserExecute */
  /* User code implementation */
#ifdef _RTOS
  uint32_t _timing = osWaitForever;
  osMessageQId  queue = *(osMessageQId *)argument;

  do
  {
#if (osCMSIS < 0x20000U)
    osEvent event = osMessageGet(queue, _timing);
    switch (((DPM_USER_EVENT)event.value.v & 0xF))
#else
    uint32_t event;
    (void)osMessageQueueGet(queue, &event, NULL, _timing);
    switch (((DPM_USER_EVENT)event & 0xF))
#endif /* osCMSIS < 0x20000U */
    {
    case DPM_USER_EVENT_TIMER:
      {
#endif /* _RTOS */
#if defined(USBPD_REV30_SUPPORT)
#if _SRC_CAPA_EXT
        /* Manage the extended capa */
        DPM_ManageExtendedCapa();

#endif /* _SRC_CAPA_EXT */
#if _ALERT
        DPM_ManageAlert();

#endif /* _ALERT */
#endif /* USBPD_REV30_SUPPORT */
#ifdef _RTOS
        break;
      }

    default:
      break;
    }
    _timing = CheckDPMTimers();
  }
  while(1);
#else
#if defined(_GUI_INTERFACE)
  GUI_Execute();
#endif /* _GUI_INTERFACE */
#endif /* _RTOS */
/* USER CODE END USBPD_DPM_UserExecute */
}

/**
  * @brief  UserCableDetection reporting events on a specified port from CAD layer.
  * @param  PortNum The handle of the port
  * @param  State CAD state
  * @retval None
  */
void USBPD_DPM_UserCableDetection(uint8_t PortNum, USBPD_CAD_EVENT State)
{
/* USER CODE BEGIN USBPD_DPM_UserCableDetection */
  DEMO_PostCADMessage(PortNum, State, DPM_Params[PortNum].ActiveCCIs);

  switch(State)
  {
  case USBPD_CAD_EVENT_ATTEMC:
#if defined(_VCONN_SUPPORT)
    /* Save flag to keep information that cable is a EMC. */
    DPM_Ports[PortNum].DPM_CablePDCapable = USBPD_TRUE;
#endif /* _VCONN_SUPPORT */
  case USBPD_CAD_EVENT_ATTACHED:
    /* Format and send a notification to GUI if enabled */
    if (NULL != DPM_GUI_FormatAndSendNotification)
    {
      DPM_GUI_FormatAndSendNotification(PortNum, DPM_GUI_NOTIF_ISCONNECTED, 0);
    }

