STMicroelectronics/STM32CubeL5/Projects/STM32L552E-EV/Demonstrations/Modules/ucpd/usbpd_dpm_user.c
#ifdef _VDM
    USBPD_VDM_UserReset(PortNum);
#endif /* _VDM */
#if defined(_SRC) || defined(_DRP)
    if(USBPD_PORTPOWERROLE_SRC == DPM_Params[PortNum].PE_PowerRole)
    {
      USBPD_DPM_WaitForTime(110);
      if (USBPD_OK != USBPD_PWR_IF_VBUSEnable(PortNum))
      {
        /* display the error */
        DEMO_PostMMIMessage(DEMO_MMI_ACTION_ERROR_POWER);
        /* Should not occur */
        USBPD_DPM_WaitForTime(6000);
        NVIC_SystemReset();
      }
    }
#endif /* _SRC || _DRP */
    DPM_Ports[PortNum].DPM_IsConnected = 1;
    break;

  case USBPD_CAD_EVENT_DETACHED :
  case USBPD_CAD_EVENT_EMC :
  default :
    /* reset all values received from port partner */
    memset(&DPM_Ports[PortNum], 0, sizeof(DPM_Ports[PortNum]));

    /* Format and send a notification to GUI if enabled */
    if (NULL != DPM_GUI_FormatAndSendNotification)
    {
      DPM_GUI_FormatAndSendNotification(PortNum, DPM_GUI_NOTIF_ISCONNECTED | DPM_GUI_NOTIF_POWER_EVENT, 0);
    }

#ifdef _VDM
    USBPD_VDM_UserReset(PortNum);
#endif /* _VDM */

#if defined(_SRC) || defined(_DRP)
    if(USBPD_PORTPOWERROLE_SRC == DPM_Params[PortNum].PE_PowerRole)
    {
      if (USBPD_OK != USBPD_PWR_IF_VBUSDisable(PortNum))
      {
        /* Should not occur */
        while(1);
      }
    }
#endif /* _SRC || _DRP */

#if defined(_VCONN_SUPPORT)
    if(USBPD_TRUE == DPM_Params[PortNum].VconnStatus)
    {
      /* Switch Off Vconn */
      USBPD_DPM_PE_VconnPwr(PortNum, USBPD_DISABLE);
    }
#endif /* _VCONN_SUPPORT */
    break;
  }
/* USER CODE END USBPD_DPM_UserCableDetection */
}

/**
  * @brief  function used to manage user timer.
  * @param  PortNum Port number
  * @retval None
  */
void USBPD_DPM_UserTimerCounter(uint8_t PortNum)
{
/* USER CODE BEGIN USBPD_DPM_UserTimerCounter */
#ifdef USBPD_REV30_SUPPORT
#if _SRC_CAPA_EXT
  if((DPM_Ports[PortNum].DPM_TimerSRCExtendedCapa & DPM_TIMER_READ_MSK) > 0)
  {
    DPM_Ports[PortNum].DPM_TimerSRCExtendedCapa--;
  }
#endif /* _SRC_CAPA_EXT */
#if _ALERT
  if((DPM_Ports[PortNum].DPM_TimerAlert & DPM_TIMER_READ_MSK) > 0)
  {
    DPM_Ports[PortNum].DPM_TimerAlert--;
  }
#endif /* _ALERT */
#endif /* USBPD_REV30_SUPPORT */
/* USER CODE END USBPD_DPM_UserTimerCounter */
}

/**
  * @}
  */

/** @defgroup USBPD_USER_EXPORTED_FUNCTIONS_GROUP2 USBPD USER Exported Callbacks functions called by PE
  * @{
  */

#if !defined(USBPDCORE_LIB_NO_PD)
/**
  * @brief  Callback function called by PE layer when HardReset message received from PRL
  * @param  PortNum     The current port number
  * @param  CurrentRole the current role
  * @param  Status      status on hard reset event
  * @retval None
  */
void USBPD_DPM_HardReset(uint8_t PortNum, USBPD_PortPowerRole_TypeDef CurrentRole, USBPD_HR_Status_TypeDef Status)
{
/* USER CODE BEGIN USBPD_DPM_HardReset */
#ifdef _VDM
  USBPD_VDM_UserReset(PortNum);
#endif /* _VDM */
#if defined(USBPD_REV30_SUPPORT) && _ALERT
  /* Stop Alert timer */
  DPM_Ports[PortNum].DPM_TimerAlert    = 0;
  DPM_Ports[PortNum].DPM_SendAlert.d32 = 0;
#endif /* USBPD_REV30_SUPPORT && _ALERT */
#if defined(_VCONN_SUPPORT)
  /* Reset flag DPM_CableResetOnGoing */
  DPM_Ports[PortNum].DPM_CableResetOnGoing = USBPD_FALSE;
#endif /* _VCONN_SUPPORT */

  switch (Status)
  {
#if defined(_SRC) || defined(_DRP)
  case USBPD_HR_STATUS_WAIT_VBUS_VSAFE0V:
    if (USBPD_PORTPOWERROLE_SRC == CurrentRole)
    {
      /* Reset the power supply */
      DPM_TurnOffPower(PortNum, USBPD_PORTPOWERROLE_SRC);
    }
    break;
  case USBPD_HR_STATUS_WAIT_VBUS_VSAFE5V:
    if (CurrentRole == USBPD_PORTPOWERROLE_SRC)
    {
#if defined(_VCONN_SUPPORT)
      /* When VCONN is supported, the Hard Reset Shall cause the Port with the Rp resistor asserted to supply VCONN */
      if (USBPD_TRUE == DPM_Ports[PortNum].DPM_CablePDCapable)
      {
        DPM_Params[PortNum].VconnStatus = USBPD_TRUE;
      }
#endif /* _VCONN_SUPPORT */
      /* Power on the power supply */
      DPM_TurnOnPower(PortNum, CurrentRole);
    }
    break;
#endif /* _SRC || _DRP */
  case USBPD_HR_STATUS_COMPLETED:
    break;
  case USBPD_HR_STATUS_FAILED:
    break;
  default:
      break;
  }
/* USER CODE END USBPD_DPM_HardReset */
}

#if defined(_SRC) || defined(_DRP)
/**
  * @brief  Request the DPM to setup the new power level.
  * @param  PortNum The current port number
  * @retval USBPD status
  */
USBPD_StatusTypeDef USBPD_DPM_SetupNewPower(uint8_t PortNum)
{
/* USER CODE BEGIN USBPD_DPM_SetupNewPower */
  return  USBPD_PWR_IF_SetProfile(PortNum);
/* USER CODE END USBPD_DPM_SetupNewPower */
}

#endif /* _SRC || _DRP */
/**
  * @brief  Evaluate the swap request from PE.
  * @param  PortNum The current port number
  * @retval USBPD_ACCEPT, USBPD_WAIT, USBPD_REJECT
  */
USBPD_StatusTypeDef USBPD_DPM_EvaluatePowerRoleSwap(uint8_t PortNum)
{
/* USER CODE BEGIN USBPD_DPM_EvaluatePowerRoleSwap */
  return USBPD_ACCEPT;
/* USER CODE END USBPD_DPM_EvaluatePowerRoleSwap */
}

/**
  * @brief  Callback function called by PE to inform DPM about PE event.
  * @param  PortNum The current port number
  * @param  EventVal @ref USBPD_NotifyEventValue_TypeDef
  * @retval None
  */
void USBPD_DPM_Notification(uint8_t PortNum, USBPD_NotifyEventValue_TypeDef EventVal)
{
/* USER CODE BEGIN USBPD_DPM_Notification */
  DEMO_PostNotificationMessage(PortNum, EventVal);

  switch(EventVal)
  {
    /***************************************************************************
                              Power Notification
    */
    case USBPD_NOTIFY_POWER_EXPLICIT_CONTRACT :
    {
      /* Power ready means an explicit contract has been establish and Power is available */
#if defined(_VDM)
      /* Request VDM identify only if not already entered in VDM mode */
      if ((0 == VDM_Mode_On[PortNum]) && (USBPD_PORTDATAROLE_DFP == DPM_Params[PortNum].PE_DataRole))
      {
        USBPD_PE_SVDM_RequestIdentity(PortNum, USBPD_SOPTYPE_SOP);
      }
#endif /*_VDM*/
#if defined(USBPD_REV30_SUPPORT)
#if _ALERT
#if defined(_SRC) || defined(_DRP)
      if ((USBPD_SPECIFICATION_REV3 == DPM_Params[PortNum].PE_SpecRevision)
          && (USBPD_PORTPOWERROLE_SRC == DPM_Params[PortNum].PE_PowerRole))
      {
        DPM_START_TIMER(PortNum, DPM_TimerAlert, DPM_TIMER_ALERT);
      }
#endif /* _SRC || _DRP */
#endif /* _ALERT */
#endif /* USBPD_REV30_SUPPORT */
      break;
    }
    /*
                              End Power Notification
     ***************************************************************************/
#if defined(_SNK) || defined(_DRP)
    /***************************************************************************
                               REQUEST ANSWER NOTIFICATION
    */
    case USBPD_NOTIFY_REQUEST_ACCEPTED:
      /* Update the VBUS threshold according the new request */
      USBPD_PWR_IF_UpdateVbusThreshold(PortNum);

