STMicroelectronics/STM32CubeL5/Projects/STM32L552E-EV/Demonstrations/Modules/ucpd/usbpd_dpm_user.c
      /* Update DPM_RDOPosition only if current role is SNK */
      if (USBPD_PORTPOWERROLE_SNK == DPM_Params[PortNum].PE_PowerRole)
      {
        USBPD_SNKRDO_TypeDef rdo;
        rdo.d32                                   = DPM_Ports[PortNum].DPM_RequestDOMsg;
        DPM_Ports[PortNum].DPM_RDOPosition        = rdo.GenericRDO.ObjectPosition;

        if (NULL != DPM_GUI_SaveInfo)
        {
          DPM_GUI_SaveInfo(PortNum, USBPD_CORE_DATATYPE_RDO_POSITION, (uint8_t*)&DPM_Ports[PortNum].DPM_RDOPosition, 4);
        }

      }
      break;
      /*
      ***************************************************************************/

    case USBPD_NOTIFY_REQUEST_REJECTED:
    case USBPD_NOTIFY_REQUEST_WAIT:
      /* Requested rejected by the source */
      break;

  case USBPD_NOTIFY_POWER_SWAP_TO_SNK_DONE:
    USBPD_PWR_IF_ResetVbusThreshold(PortNum);
    break;
#endif /* _SNK || _DRP */

#if defined(_VDM) || defined(_SNK) || defined(_DRP)
    case USBPD_NOTIFY_HARDRESET_RX:
    case USBPD_NOTIFY_HARDRESET_TX:
    {
#if defined(_SNK) || defined(DRP)
      USBPD_PWR_IF_ResetVbusThreshold(PortNum);
#endif

#if defined(_VDM)
      if (USBPD_PORTPOWERROLE_SNK == DPM_Params[PortNum].PE_PowerRole)
      {
          USBPD_VDM_UserReset(PortNum);
      }
      break;
#endif /* _VDM */
    }
#endif /* _VDM || _SNK || _DRP */

#if defined(_SNK) || defined(_DRP)
    case USBPD_NOTIFY_STATE_SNK_READY:
      {
#if defined(USBPD_REV30_SUPPORT)
#if _SRC_CAPA_EXT
        /* Send GET_SRC_CAPA_EXT only if current revision is PD3.0 */
        if ((USBPD_SPECIFICATION_REV3 == DPM_Params[PortNum].PE_SpecRevision)
         && (1 == DPM_Ports[PortNum].FlagSendGetSrcCapaExtended))
        {
          DPM_START_TIMER(PortNum, DPM_TimerSRCExtendedCapa, DPM_TIMER_GET_SRC_CAPA_EXT);
          DPM_Ports[PortNum].FlagSendGetSrcCapaExtended = 0;
        }
#endif /* _SRC_CAPA_EXT*/
#endif /* USBPD_REV30_SUPPORT */
      }
      break;

#endif /* _SNK || _DRP */
    case USBPD_NOTIFY_STATE_SRC_DISABLED:
      {
        /* SINK Port Partner is not PD capable. Legacy cable may have been connected
           In this state, VBUS is set to 5V */
      }
      break;
#if defined(USBPD_REV30_SUPPORT)
#if _ALERT
    case USBPD_NOTIFY_ALERT_RECEIVED :
      {
#if _BATTERY
        uint32_t index = 0;
        /*!< Battery Status Change Event(Attach/Detach/charging/discharging/idle) */
        if (USBPD_ADO_TYPE_ALERT_BATTERY_STATUS == (DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert & USBPD_ADO_TYPE_ALERT_BATTERY_STATUS))
        {
          USBPD_GBSDB_TypeDef get_battery_status;
          uint32_t battery_found = 0;

          /* Set default value for BatteryStatusRef
             (useful when no battery selected Fixed Batteries or Hot Swappable Batteries fields in ALERT message
              as in MQP implementation of Test PROT-SRC3-STATUS */
          get_battery_status.BatteryStatusRef = 0;

          for (index = 0; index < 4; index++)
          {
            if ((1 << index) == (DPM_Ports[PortNum].DPM_RcvAlert.b.FixedBatteries & (1 << index)))
            {
              get_battery_status.BatteryStatusRef = index;
              battery_found = 1;
              break;
            }
          }
          if (!battery_found)
          {
            for (index = 0; index < 4; index++)
            {
              if ((1 << index) == (DPM_Ports[PortNum].DPM_RcvAlert.b.HotSwappableBatteries & (1 << index)))
              {
                get_battery_status.BatteryStatusRef = index + 4;
                battery_found = 1;
                break;
              }
            }
          }

          /* Post a GET_BATTERY_STATUS message to PE */
          USBPD_DPM_RequestGetBatteryStatus(PortNum, (uint8_t*)&get_battery_status);

          /* Reset Battery Status bit */
          DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert &= ~USBPD_ADO_TYPE_ALERT_BATTERY_STATUS;
          break;
        }
#endif /* _BATTERY */
        /*!< Over-Current Protection event when set (Source only, for Sink Reserved and Shall be set to zero) */
        /* Bit reserved for a Sink */
        if ((USBPD_PORTPOWERROLE_SNK == DPM_Params[PortNum].PE_PowerRole)
                 && (USBPD_ADO_TYPE_ALERT_OCP == (DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert & USBPD_ADO_TYPE_ALERT_OCP)))
        {
          /* Reset OCP bit */
          DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert &= ~USBPD_ADO_TYPE_ALERT_OCP;
          /* Send a Get_Status */
          goto _ctrl_msg;
        }
        /*!< Over-Temperature Protection event when set. */
        else if (USBPD_ADO_TYPE_ALERT_OTP == (DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert & USBPD_ADO_TYPE_ALERT_OTP))
        {
          /* Reset OTP bit */
          DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert &= ~USBPD_ADO_TYPE_ALERT_OTP;
          /* Send a Get_Status */
          goto _ctrl_msg;
        }
        /*!< Operating Condition Change when set */
        else if (USBPD_ADO_TYPE_ALERT_OPERATING_COND == (DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert & USBPD_ADO_TYPE_ALERT_OPERATING_COND))
        {
          /* Reset OP COND bit */
          DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert &= ~USBPD_ADO_TYPE_ALERT_OPERATING_COND;
          /* Send a Get_Status */
          goto _ctrl_msg;
        }
        /*!< Source Input Change Event when set */
        else if (USBPD_ADO_TYPE_ALERT_SRC_INPUT == (DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert & USBPD_ADO_TYPE_ALERT_SRC_INPUT))
        {
          /* Reset SRC input bit */
          DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert &= ~USBPD_ADO_TYPE_ALERT_SRC_INPUT;
          /* Send a Get_Status */
          goto _ctrl_msg;
        }
        /*!< Over-Voltage Protection event when set (Sink only, for Source Reserved and Shall be set to zero) */
        /* Bit reserved for a Source */
        else
        {
#if defined(_SRC) || defined(_DRP)
          if ((USBPD_PORTPOWERROLE_SRC == DPM_Params[PortNum].PE_PowerRole)
                 && (USBPD_ADO_TYPE_ALERT_OVP == (DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert & USBPD_ADO_TYPE_ALERT_OVP)))
          {
            /* Reset OVP bit */
            DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert &= ~USBPD_ADO_TYPE_ALERT_OVP;
            /* Send a Get_Status */
            goto _ctrl_msg;
          }
#endif /* _SRC || _DRP */
        }

